docs/artillery-high.txt
Test run id: tqfbd_xbpgm73metknngqg3yn6baegzpmaj_3xjj
Phase started: Carga alta (index: 0, duration: 60s) 03:13:06(-0500)

--------------------------------------
Metrics for period to: 03:13:10(-0500) (width: 2.704s)
--------------------------------------

http.codes.200: ................................................................ 74
http.downloaded_bytes: ......................................................... 7548
http.request_rate: ............................................................. 60/sec
http.requests: ................................................................. 74
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 13
  mean: ........................................................................ 2.6
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 13
  mean: ........................................................................ 2.6
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 4
http.responses: ................................................................ 74
vusers.completed: .............................................................. 74
vusers.created: ................................................................ 75
vusers.created_by_name.Prueba alta HAProxy: .................................... 75
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.1
  max: ......................................................................... 18.2
  mean: ........................................................................ 7.8
  median: ...................................................................... 6.4
  p95: ......................................................................... 13.6
  p99: ......................................................................... 17.6


--------------------------------------
Metrics for period to: 03:13:20(-0500) (width: 9.999s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 30600
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 301
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 11
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 11
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.Prueba alta HAProxy: .................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 14.2
  mean: ........................................................................ 3.9
  median: ...................................................................... 3.7
  p95: ......................................................................... 5.6
  p99: ......................................................................... 6.8


--------------------------------------
Metrics for period to: 03:13:30(-0500) (width: 9.997s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 30600
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 5
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 5
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.Prueba alta HAProxy: .................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.2
  max: ......................................................................... 6.6
  mean: ........................................................................ 3.6
  median: ...................................................................... 3.5
  p95: ......................................................................... 5.1
  p99: ......................................................................... 6


--------------------------------------
Metrics for period to: 03:13:40(-0500) (width: 9.997s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 30600
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 6
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 6
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.Prueba alta HAProxy: .................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.2
  max: ......................................................................... 6.9
  mean: ........................................................................ 3.4
  median: ...................................................................... 3.3
  p95: ......................................................................... 4.9
  p99: ......................................................................... 6.1


--------------------------------------
Metrics for period to: 03:13:50(-0500) (width: 9.998s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 30600
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 6
  mean: ........................................................................ 1.9
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 6
  mean: ........................................................................ 1.9
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.Prueba alta HAProxy: .................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.7
  max: ......................................................................... 7.1
  mean: ........................................................................ 3.1
  median: ...................................................................... 3
  p95: ......................................................................... 4.3
  p99: ......................................................................... 5.1


--------------------------------------
Metrics for period to: 03:14:00(-0500) (width: 9.998s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 30600
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 7
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 7
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.Prueba alta HAProxy: .................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.1
  max: ......................................................................... 9.2
  mean: ........................................................................ 3.4
  median: ...................................................................... 3.2
  p95: ......................................................................... 4.7
  p99: ......................................................................... 6


Phase completed: Carga alta (index: 0, duration: 60s) 03:14:06(-0500)

--------------------------------------
Metrics for period to: 03:14:10(-0500) (width: 7.755s)
--------------------------------------

http.codes.200: ................................................................ 226
http.downloaded_bytes: ......................................................... 23052
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 225
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 226
vusers.completed: .............................................................. 226
vusers.created: ................................................................ 225
vusers.created_by_name.Prueba alta HAProxy: .................................... 225
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2
  max: ......................................................................... 5.1
  mean: ........................................................................ 3.2
  median: ...................................................................... 3.2
  p95: ......................................................................... 4.5
  p99: ......................................................................... 5


All VUs finished. Total time: 1 minute, 2 seconds

--------------------------------
Summary report @ 03:14:10(-0500)
--------------------------------

http.codes.200: ................................................................ 1800
http.downloaded_bytes: ......................................................... 183600
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 1800
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 13
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 13
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 1800
vusers.completed: .............................................................. 1800
vusers.created: ................................................................ 1800
vusers.created_by_name.Prueba alta HAProxy: .................................... 1800
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.7
  max: ......................................................................... 18.2
  mean: ........................................................................ 3.6
  median: ...................................................................... 3.4
  p95: ......................................................................... 5.2
  p99: ......................................................................... 11.6